# Copyright (C) 2016-present Arctic Ice Studio <development@arcticicestudio.com>
# Copyright (C) 2016-present Sven Greb <development@svengreb.de>

# Project:    igloo
# Repository: https://github.com/arcticicestudio/igloo
# License:    MIT

tap "2ion/mpv-bash-completion"
tap "arcticicestudio/bitfroest-brew", "~/yggdrasil/bitfroest-brew.git"
tap "cjbassi/gotop"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-eid"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/livecheck"
tap "wagoodman/dive"

brew "asciinema"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "buku"
brew "cmake"
brew "cabextract"
brew "cmark"
brew "cmark-gfm"
brew "coreutils"
brew "ctop"
brew "diffutils"
brew "diff-so-fancy"
brew "dive"
brew "docker-completion"
brew "docker-compose-completion"
brew "e2fsprogs"
brew "e2tools"
brew "entr"
brew "exiv2"
brew "ext4fuse"
brew "fd"
brew "ffmpeg", args: ["with-fdk-aac", "with-fontconfig", "with-freetype", "with-frei0r", "with-libass", "with-libbluray", "with-libgsm", "with-librsvg", "with-libsoxr", "with-libssh", "with-libvidstab", "with-libvorbis", "with-libvpx", "with-opencore-amr", "with-openh264", "with-openjpeg", "with-openssl", "with-opus", "with-rtmpdump", "with-sdl2", "with-speex", "with-srt", "with-theora", "with-tools", "with-wavpack", "with-webp", "with-x265", "with-xz"]
brew "findutils", args: ["with-default-names"]
brew "fswatch"
brew "fzf"
# Support to mount ext2/3/4 filesystems in read/write mode.
# Note that this forumla requires manual post-installations (as root) of the filesystem extension and preferences pane!
brew "https://raw.githubusercontent.com/yalp/homebrew-core/fuse-ext2/Formula/fuse-ext2.rb", args: ["HEAD"]
brew "gem-completion"
brew "gifsicle"
brew "git"
brew "glances"
brew "gocryptfs"
brew "gotop"
brew "gpatch"
brew "gpg"
brew "gradle", args: ["with-all"]
brew "gradle-completion"
brew "grep", args: ["with-default-names"]
brew "gzip"
brew "git-crypt"
brew "git-sizer"
brew "gnu-sed", args: ["with-default-names"]
brew "gnu-tar", args: ["with-default-names"]
brew "gnu-which", args: ["with-default-names"]
brew "hostess"
brew "htop", args: ["with-ncurses"]
brew "httpie"
brew "hub"
brew "icu4c"
brew "ifuse"
brew "imagemagick", args: ["with-fftw", "with-fontconfig", "with-hdri", "with-libheif", "with-libqr", "with-librsvg", "with-libwmf", "with-little-cms", "with-little-cms2", "with-opencl", "with-openexr", "with-openjpeg", "with-openmp", "with-perl", "with-webp", "with-x11"]
brew "imageoptim-cli"
brew "iproute2mac"
brew "jo"
brew "jq"
brew "launchctl-completion"
brew "less", args: ["with-pcre"]
brew "lsyncd"
brew "make", args: ["with-default-names"]
brew "mariadb"
brew "mas"
brew "maven"
brew "maven-completion"
brew "mongodb", args: ["with-sasl"]
brew "moreutils"
brew "mpv", args: ["with-jack", "with-libaacs", "with-libarchive", "with-libbluray", "with-libcaca", "with-libdvdnav", "with-libdvdread", "with-uchardet", "with-vapoursynth", "with-x11"]
brew "mpv-bash-completion", args: ["HEAD"]
brew "neofetch"
brew "nmap"
brew "node"
brew "noti"
brew "nq"
brew "ntfs-3g"
brew "openfortivpn"
brew "openssh", args: ["with-ldns"]
brew "openvpn"
brew "pdfgrep", args: ["with-pcre"]
brew "pinentry-mac"
brew "pip-completion"
brew "prettyping"
brew "python"
brew "python2"
brew "rg"
brew "rsync"
brew "rust"
brew "rustc-completion"
brew "sassc"
brew "shellcheck"
brew "shellharden"
brew "sqlite"
brew "streamlink"
brew "task", args: ["without-gnutls"]
brew "terminal-notifier"
brew "timewarrior"
brew "tldr"
brew "tmux", args: ["with-utf8proc"]
brew "trash-cli"
brew "tree"
brew "vim", args: ["with-client-server", "with-gettext", "with-lua", "with-luajit", "with-override-system-vi", "with-tcl"]
brew "wallpaper"
brew "watchman"
brew "webp"
brew "wget", args: ["with-gpgme", "with-libmetalink", "with-pcre"]
brew "woff2"
brew "youtube-dl"

cask "atom"
cask "bitbar"
cask "db-browser-for-sqlite"
# Provides `docker-completion`, `docker-compose` and `docker-credential-helper`.
cask "docker"
cask "dropbox"
cask "firefox"
cask "firefox-developer-edition"
cask "font-bitstream-vera"
cask "font-bitstreamverasansmono-nerd-font"
cask "font-courier-prime"
cask "font-courier-prime-code"
cask "font-courier-prime-sans"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-firacode-nerd-font"
cask "font-firamono-nerd-font"
cask "font-fontawesome"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-input"
cask "font-inter-ui"
cask "font-metropolis"
cask "font-noto-color-emoji"
cask "font-noto-emoji"
cask "font-noto-sans"
cask "font-noto-serif"
cask "font-nunito"
cask "font-open-sans"
cask "font-oswald"
cask "font-overpass"
cask "font-quintessential"
cask "font-roboto"
cask "font-robotomono-nerd-font"
cask "font-roboto-mono"
cask "font-rubik"
cask "font-signika"
cask "font-sourcecodepro-nerd-font"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-symbola"
cask "font-twitter-color-emoji"
cask "font-varela-round"
cask "gdisk"
cask "gimp"
cask "google-chrome"
cask "hwsensors"
cask "iina"
cask "imageoptim"
cask "insomnia"
cask "intellij-idea"
cask "iterm2"
cask "java"
cask "java8"
cask "java-jdk-javadoc"
cask "kap"
cask "keepassxc"
cask "keybase"
cask "microsoft-teams"
cask "mongodb-compass"
cask "osxfuse"
cask "pdfsam-basic"
cask "postman"
cask "pycharm-ce"
cask "rsyncosx"
cask "slack"
cask "spectrum"
cask "tunnelblick"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "webstorm"
cask "xquartz"

mas "Gapplin", id: 768053424
mas "Gifski", id: 1351639930
mas "Magnet", id: 441258766
mas "Xcode", id: 497799835
